<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!-- import JDBC package -->
<%@include file ="static/header.jsp" %>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Support page</title>
</head>
<body>
	<div class = "loading" id = "background-rectangle3">
		<span>
		<h1>DㅓBㅔ풀기 사용 도움말 </h1>
		</span>
	</div>
	
	<div id=background-rectangle1" style="margin-top : 80px;">
		<h2>&#128293;DㅓBㅔ풀기 ?</h2>
		<h3>고마운 사람들에게 마음을 전달하는 것이 어렵게 느껴지지 않도록 여러분들의 마음을 전달해드립니다. </h3>
		<h4>기부, 선물하기의 기능으로 마음을 베풀 수 있도록 하고자 하는 저희 사이트의 목표와, DataBase의 D,B를 이용해 저희 사이트의 이름을 'DㅓBㅔ풀기'라고 짓게 되었습니다.</h4>
		<br>
	</div>
	
	<div id="background-rectangle2" style="text-align: center; align-items: center;">
        <h2>&#129330;DㅓBㅔ풀기는 어떤 플랫폼일까요?</h2>
        <h3>1. 선물하기</h3>
        <h3>1-1 기존 선물하기 플랫폼에서 사용자들이 느꼈던 부담스러움을 개선한 플랫폼입니다.</h3>
        <h4>기존에 존재하는 선물하기 서비스에서는 상대방이 직접 특정 상품을 받고 싶다고 선택해야 어떤 선물을 원하는 지 알 수 있거나, 
        상대방이 등록해놓지 않은 경우 어떤 선물을 원하는지 알 수 없습니다. <br>
        하지만, 전자의 경우도 직접적으로 특정 선물을 받고 싶다고 공개하는 것이 부담스럽다는 이유로 
        많은 사람들이 이용하지 않고 있습니다. </h4>
        <h4>'DㅓBㅔ풀기'에서는 가입 시 최근 관심있는 상품카테고리를 선택해야하기 때문에 덜 부담스러운 방식으로 
        모든 사용자의 최근 관심사를 알 수 있습니다.</h4>
        <h3>1-2 공익에 도움이 되는 쇼핑몰 사이트를 추천해주는 플랫폼입니다.</h3>
        <h4>저희 사이트에서는 상대방이 선택한 관심있는 상품 카테고리를 판매하고 있는 쇼핑몰 사이트를 추천해주고 있습니다. <br>
        여기서 더 나아가 저희 사이트 이름에 걸맞게 일반 링크뿐만 아니라 공익에 도움이 되는 공익링크를 함께 추천해주고 있습니다. </h4>
        <h4>'DㅓBㅔ풀기'에서는 선물을 받는 사람 뿐만아니라 사회적약자, 사회단체 등 도움이 필요한 존재들에게까지 마음이 전달 될 수 있도록 힘쓰고 있습니다.</h4>
        <br>
        
        <h3>2. 기부하기</h3>
        <h3>2-1 사용자 맞춤 기부 단체를 추천해주는 플랫폼입니다.</h3>
        <h4>선물하기와 동일하게 사이트에 가입할 때 선호하는 기부 기간, 수혜자, 기부 단체를 설정하게 됩니다.
        사이트에서는 사용자가 선호하는 기부 타입을 고려하여 다양한 기부 활동을 추천해줍니다. </h4>
        <h4>
        'DㅓBㅔ풀기'에서는 기부가 어렵게만 느껴졌던 사람들을 위해 사용자에게 맞는 기부 활동을 추천해주고 사용자들이 많은 기부 수혜자들에게 마음을 베풀 수 있도록 도와주고 있습니다.
        </h4>
        <br>
    </div>
    
    
    <div id="background-rectangle1">
        <h2>&#10068; 'DㅓBㅔ풀기'를 어떻게 사용해야 할까요?</h2>

        <body>
        	<h2>0. 공통</h2>
        	<h3>0-1. 회원가입 페이지</h3>
            <img src="" style="margin-right:20px; " width="800px">
            <h4>'DㅓBㅔ풀기'의 계정이 없는 사용자의 경우,</h4>
            <h4>로그인 페이지에서 회원가입(Sign up)을 클릭하여 회원가입할 수 있습니다.</h4>
            <h4>아이디, 비밀번호, 이름, 주소, 전화번호를 입력하여 회원가입이 가능합니다. 5개의 항목 중 한 가지라도 입력되지 않은 항목이 있으면 회원가입을 할 수 없습니다.</h4>
            <h4>기존의 아이디와 중복되는 아이디로 회원가입을 할 수 없다.</h4>
            <br>
        	<h3>0-2. 로그인 페이지</h3>
            <img src="" style="margin-right:20px; " width="800px">
            <h4>사전에 가입한 자신의 'DㅓBㅔ풀기'계정으로 로그인합니다. </h4>
            <h4>사용자 타입을 구분해서 자신에게 맞는 타입을 선택한 후 로그인합니다.</h4>
			<br>
			<br>
        	
            <h2>1. 일반 사용자 (basic) </h2>
            
            <h3>1-1. 마이페이지</h3>
            <img src="" style="margin-right:20px; " width="800px">
            <h4>(1) 정보수정 </h4>
            <h4>나의 정보 수정으로 아이디, 비밀번호, 기본 정보(전화번호, 이름, 주소),기부 취향, 선물 취향 정보를 수정할 수 있습니다. </h4>
            <h4>(2) 기부/선물 내역 조회</h4>
            <h4>선물 주문 내역, 기부 참여 목록을 조회할 수 있습니다.</h4>
            <h4>(3) 기부/선물 취향 등록</h4>
            <h4>처음 회원가입 이후 로그인했을 때 사용자의 기부 취향, 선물 취향을 등록할 수 있습니다. </h4>
            <h4>(4) 회원 탈퇴</h4>
            
            <br>
            <h3>1-2. 기부하기 페이지</h3>
            <img src="" style="margin-right:20px; " width="800px">
            <h4>다양한 기부 활동을 추천해줍니다.</h4>
            <h4>뿐만 아니라, 베스트 기간 맞춤, 수혜자 맞춤의 필터링으로 자신에게 맞는 기부 활동을 볼 수 있습니다.</h4>
            <h4>사용자가 기부하고 싶은 기부 활동이 있을 때, 참여하기 버튼으로 기부 활동을 진행할 수 있습니다.</h4>
            
            <br>
            <h3>1-3. 선물하기 페이지</h3>
            <img src="" style="margin-right:20px; " width="800px">
            <h4> 선물하고자 하는 상대방의 아이디를 조회하고, 상대방의 관심사를 조회할 수 있습니다.</h4>
            <h4>상대방이 관심있는 상품을 판매하는 쇼핑몰을 볼 수 있고, 선물을 확정할 수 있습니다.</h4>
            
            <br>
            <h3>1-4. FAQ 페이지</h3>
            <img src="" style="margin-right:20px; " width="800px">
            <h4>사용자 관련, 상품 자체 관련, 기부 관련, 선물 관련 질의에 대한 답을 알 수 있습니다.</h4>
            <br>
			<br>

			<h2>2. 아웃소싱 사용자 (outsourcing) </h2>
			<h3>2-1. 주문(의뢰) 조회 페이지</h3>
            <img src="" style="margin-right:20px; " width="800px">
            <h4>외주 업체로 들어온 주문(의뢰)내역을 조회할 수 있습니다.</h4>
            
            <h2>3. 기부 단체 사용자 사용자 (donate) </h2>
			<h3>3-1. 기부 활동 등록 페이지</h3>
            <img src="" style="margin-right:20px; " width="800px">
            <h4>공고로 게시하고자하는 기부 활동을 등록하여 참가자를 모집할 수 있습니다. </h4>
            
            <br>
            <h3>3-2. 기부 참여자 조회 페이지</h3>
            <img src="" style="margin-right:20px; " width="800px">
            <h4>어떤 사용자들이 기부에 참여하는 지 조회할 수 있습니다. </h4>
           

        </body>
    </div>

	
	<a href="Main.jsp">메인 페이지로 이동하기</a>
	<br>
	
	</div>
	
</body>
<%-- <%@include file ="static/footer.jsp" %> --%>
</html>

